# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 dual-label object detection model
# This model supports dual classification where each object gets two labels from separate sets
# Example use case: Bird species detection with call type classification

# Parameters
nc1: 5   # number of classes for first classification head
nc2: 3   # number of classes for second classification head
scales: # model compound scaling constants, i.e. 'model=yolo11n-dual.yaml' will call yolo11-dual.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, parameters TBD, gradients TBD, GFLOPs TBD
  s: [0.50, 0.50, 1024] # summary: 181 layers, parameters TBD, gradients TBD, GFLOPs TBD
  m: [0.50, 1.00, 512]  # summary: 231 layers, parameters TBD, gradients TBD, GFLOPs TBD
  l: [1.00, 1.00, 512]  # summary: 357 layers, parameters TBD, gradients TBD, GFLOPs TBD
  x: [1.00, 1.50, 512]  # summary: 357 layers, parameters TBD, gradients TBD, GFLOPs TBD

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n dual-label head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, DualDetect, [nc1, nc2]] # DualDetect(P3, P4, P5)